Documents/ПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручениеИсходящее</Name>
			<BasedOn>
				<xr:Item>Document.ВыводДенежныхСредств</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.Оплата</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
				<xr:Item>Document.РазмещениеКредитногоИнструмента</xr:Item>
				<xr:Item>Document.Распоряжение</xr:Item>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ПогашениеПаев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеПлатежногоПоручения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыПорученийНаПереводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПорученийНаПереводДенежныхСредств</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПорученийНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПоручениеНаПереводДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПлатежноеПоручениеИсходящее/Ext/ObjectModule.bsl
#Область Обработчики_событий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
		
	ЭтотОбъект.Валюта						= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета");
	
	НоваяСтрокаОснования = ЭтотОбъект.Основания.Добавить();
	НоваяСтрокаОснования.Основание = ДанныеЗаполнения;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ЭтотОбъект.Метаданные().ТабличныеЧасти.Основания.Реквизиты.Основание.Тип.СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		
		ТекстОшибки = "";
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		Если ТипДанныхЗаполнения = Тип("ДокументСсылка.Оплата") Тогда
						
			// Оплаты могут быть только расходные в рублях
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "ВалютаОплаты, ВидДвижения");
			Если Не (ЭтотОбъект.Валюта = РеквизитыОснования.ВалютаОплаты И ДанныеЗаполнения.ВидДвижения = Перечисления.ВидыДвижений.Расход И ДанныеЗаполнения.Аванс) Тогда				
				ТекстОшибки = "Ввод платежного поручения на возможен только основании расхода авансом в рублях";				
			КонецЕсли;
			
		ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
			
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Валюта, ТипЗадолженности, ВыводВсехАктивов");
			
			Если Не (ЭтотОбъект.Валюта = РеквизитыОснования.Валюта И 
					ДанныеЗаполнения.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская 
					Или ДанныеЗаполнения.ВыводВсехАктивов) Тогда				
				ТекстОшибки = "Ввод платежного поручения возможен только на основании поручения на вывод денежных средств в рублях";				
			Иначе
			
				// Поручение должно быть согласовано
				Отказ = Ложь;
			    РаботаСДокументами.ПроверитьВозможностьСозданияПодчиненногоДокументаНаОснованииПоручения(ЭтотОбъект, Отказ);
				Если Отказ Тогда
					ЭтотОбъект.Основания.Очистить();
					ТекстОшибки = "Ошибка заполнения платежного поручения";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") 
			Или ТипДанныхЗаполнения = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда
			
			ДанныеЗаполненияПереводДС = ТипДанныхЗаполнения = Тип("ДокументСсылка.ПереводДенежныхСредств");
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Валюта, Брокер, МестоХранения");
			
			Если Не (ЭтотОбъект.Валюта = РеквизитыОснования.Валюта И 
					ДанныеЗаполнения.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка()
					И ДанныеЗаполнения.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок) Тогда
					
				ТекстОшибки = СтрШаблон("Ввод платежного поручения возможен только на основании %1 денежных средств с расчетного счета клиента на внебирже.",
								?(ДанныеЗаполненияПереводДС, "перевода", "поручения на перевод"));
			
			КонецЕсли;  
						
			Если ДанныеЗаполненияПереводДС И РаботаСДокументами.ДействуетКонтрольПорученийВнутреннейСистемы(ТекущаяДатаСеанса(), ЭтотОбъект.Организация) Тогда
				ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Ввод платежного поручения на основании перевода запрещен, 
					|необходимо использовать поручение на перевод денежных средств";
			КонецЕсли; 			
				
		ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.Распоряжение") Тогда
			
			Если ДанныеЗаполнения.ВидОперации <> Перечисления.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента Тогда
				ТекстОшибки = СтрШаблон("Заполнение платежного поручения на основании документа типа '%1' возможно только для размещения кредитного инструмента", ТипДанныхЗаполнения);
			КонецЕсли;				
			
		ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВводДенежныхСредств") Тогда
			
			Если ДанныеЗаполнения.ВидОперации <> Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика Тогда
				ТекстОшибки = СтрШаблон("Заполнение платежного поручения на основании документа типа '%1' возможно только при поступлении денежных средств от пайщика", ТипДанныхЗаполнения);
			КонецЕсли;
					
		ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.НачислениеЗадолженности")
			Или ТипДанныхЗаполнения = Тип("ДокументСсылка.Сделка")
			Или ТипДанныхЗаполнения = Тип("ДокументСсылка.СделкаРЕПО") 
			Или ТипДанныхЗаполнения = Тип("ДокументСсылка.СделкаСНедвижимостью")
			Или ТипДанныхЗаполнения = Тип("ДокументСсылка.ОперацияНДС")
			Или ТипДанныхЗаполнения = Тип("ДокументСсылка.ПогашениеПаев") Тогда	
			
			// Здесь по отдельным задачам будут добавлены проверки.
			
		Иначе
			
			ТекстОшибки = СтрШаблон("Заполнение платежного поручения на основании документа типа '%1' не реализовано", ТипДанныхЗаполнения);
			
		КонецЕсли;		
		
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки); 
			ЭтотОбъект.Основания.Очистить();
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		ЗаполнитьДокументПоОснованию(ДанныеЗаполнения, СтандартнаяОбработка);
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "НомерПлатежногоПоручения, ИдентификаторПлатежа");  
	ЭтотОбъект.Основания.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
		
	ПроверитьСогласованиеИРасчетныйСчет(Отказ);
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
			
		Для Каждого ТекЗапись Из ЭтотОбъект.Основания Цикл
	
			Если ЗначениеЗаполнено(ТекЗапись.Основание) 
				И ТипЗнч(ТекЗапись.Основание) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда

				ТекущийСтатус = РаботаСДокументами.ПолучитьТекущийСтатусПорученияНаПереводДенежныхСредств(ТекЗапись.Основание);
		
				Если ТекущийСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Исполнено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать платежное поручение на основании поручения [" + ТекЗапись.Основание + "], которое находится в статусе [" + ТекущийСтатус + "].", ТекЗапись.Основание,,, Отказ);	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.НомерПлатежногоПоручения = 0 И ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчет) Тогда
		ЭтотОбъект.НомерПлатежногоПоручения = Документы.ПлатежноеПоручениеИсходящее.НомерПлатежногоПоручения(ЭтотОбъект.Организация, ЭтотОбъект.РасчетныйСчет, ЭтотОбъект.Дата);
	КонецЕсли;
    	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		РегистрыСведений.СтатусыИсходящихПлатежныхПоручений.УстановитьСтатусПлатежногоПоручения(ЭтотОбъект.Организация, ЭтотОбъект.Ссылка, Перечисления.СтатусыПлатежныхПоручений.Создано, ЭтотОбъект.Дата, Отказ); 
	ИначеЕсли ЭтотОбъект.ПометкаУдаления Тогда	
		РегистрыСведений.СтатусыИсходящихПлатежныхПоручений.УстановитьСтатусПлатежногоПоручения(ЭтотОбъект.Организация, ЭтотОбъект.Ссылка, Перечисления.СтатусыПлатежныхПоручений.Отменено,, Отказ); 
	КонецЕсли;
	
	//Зафиксируем новый статус для поручения (основания)
	Для Каждого ТекЗапись Из ЭтотОбъект.Основания Цикл
	
		Если ЗначениеЗаполнено(ТекЗапись.Основание) 
			И ТипЗнч(ТекЗапись.Основание) = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда

			УстановитьСтатусДокументуОснования(ТекЗапись.Основание);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура УстановитьСтатусДокументуОснования(ПоручениеСсылка)
	
	Если Не (ЭтотОбъект.Проведен Или ЭтотОбъект.ПометкаУдаления) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСтатус = РаботаСДокументами.ПолучитьТекущийСтатусПорученияНаПереводДенежныхСредств(ПоручениеСсылка);
	
	Если Не (ТекущийСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Активно
		Или ТекущийСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Отправлено) Тогда
		Возврат;
	КонецЕсли;
	
	НовыйСтатус = Неопределено;
	
	Если ЭтотОбъект.Проведен Тогда	
		НовыйСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Активно;		
	ИначеЕсли ЭтотОбъект.ПометкаУдаления Тогда
		НовыйСтатус = Перечисления.СтатусыПорученийНаПереводДенежныхСредств.Отправлено;
	КонецЕсли;  
	
	Если НовыйСтатус <> Неопределено И НовыйСтатус <> ТекущийСтатус Тогда
		РегистрыСведений.СтатусыПорученийНаПереводДенежныхСредств.УстановитьСтатусПоручения(ПоручениеСсылка, НовыйСтатус);	
	КонецЕсли;
									 	
КонецПроцедуры

#КонецОбласти

#Область Прочие_процедуры_и_функции

Процедура ЗаполнитьДокументПоОснованию(ДокументОснование, СтандартнаяОбработка)
	
	ТипОснования = ДокументОснование.Метаданные().Имя;
	Если ТипОснования = "НачислениеЗадолженности" 
		Или ТипОснования = "Оплата" Тогда
		
		СтавкаНДСОснования = СтавкаНДСИзОснования(ДокументОснование);
		
		ЗаполняемыеРеквизиты = "Организация, Контрагент";	
				
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Основание КАК Основание,
			|	ВложенныйЗапрос.Сумма КАК Сумма,
			|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
			|	&СтавкаНДС КАК СтавкаНДС,
			|	ВложенныйЗапрос.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Налоги)) КАК ПеречислениеВБюджет
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТЧОснования.Ссылка КАК Основание,
			|		ТЧОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|		ТЧОснования.Ссылка.РасчетныйСчет.Договор КАК Договор,
			|		&ДоговорКонтрагента КАК ДоговорКонтрагента,
			|		СУММА(ТЧОснования.СуммаНДС) КАК СуммаНДС,
			|		СУММА(&ПолеСуммы) КАК Сумма
			|	ИЗ
			|		&ТабличнаяЧасть КАК ТЧОснования
			|	ГДЕ
			|		ТЧОснования.Ссылка = &Ссылка
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ТЧОснования.Ссылка,
			|		ТЧОснования.Ссылка.ВидЗадолженности,
			|		ТЧОснования.Ссылка.РасчетныйСчет.Договор) КАК ВложенныйЗапрос");
		
		ВидДокумента = ДокументОснование.Метаданные().Имя;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТабличнаяЧасть", 	"Документ." + ВидДокумента + ".Основания");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДоговорКонтрагента", ?(ВидДокумента = "Оплата", "ВЫРАЗИТЬ(ТЧОснования.Ссылка КАК Документ.Оплата).РасчетныйСчетКонтрагента.Договор", "ЗНАЧЕНИЕ(Справочник.Договоры.)"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеСуммы", 			?(ВидДокумента = "Оплата", "ТЧОснования.СуммаОплаты + ТЧОснования.СуммаОплатыКупона", 							"ТЧОснования.Сумма"));
		
		Запрос.УстановитьПараметр("Ссылка",			ДокументОснование);
		Запрос.УстановитьПараметр("СтавкаНДС",		?(СтавкаНДСОснования = Перечисления.СтавкиНДС.ПустаяСсылка(), Перечисления.СтавкиНДС.БезНДС, СтавкаНДСОснования));
		Запрос.УстановитьПараметр("ВалютаУчета",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование.Организация, "ВалютаУчета"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);			
		КонецЕсли;		
	
		// Заполнение реквизитов перечисления в бюджет
		Если ЭтотОбъект.ПеречислениеВБюджет Тогда
			
			РеквизитыПеречисленияВБюджет = Документы.ПлатежноеПоручениеИсходящее.РеквизитыПеречисленияВБюджетПоУмолчанию();
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыПеречисленияВБюджет);
			
		КонецЕсли;
		
	ИначеЕсли ТипОснования = "НачислениеДивидендов" Тогда
		
		СтавкаНДСОснования = СтавкаНДСИзОснования(ДокументОснование);
		
		ЗаполняемыеРеквизиты = "Организация, Контрагент";	
				
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.Основание КАК Основание,
			|	ВложенныйЗапрос.Сумма КАК Сумма,
			|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
			|	&СтавкаНДС КАК СтавкаНДС,
			|	ВложенныйЗапрос.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Налоги)) КАК ПеречислениеВБюджет
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТЧОснования.Ссылка КАК Основание,
			|		ТЧОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|		ТЧОснования.Ссылка.РасчетныйСчет.Договор КАК Договор,
			|		&ДоговорКонтрагента КАК ДоговорКонтрагента,
			|		СУММА(ТЧОснования.СуммаНДС) КАК СуммаНДС,
			|		СУММА(&ПолеСуммы) КАК Сумма
			|	ИЗ
			|		&ТабличнаяЧасть КАК ТЧОснования
			|	ГДЕ
			|		ТЧОснования.Ссылка = &Ссылка
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ТЧОснования.Ссылка,
			|		ТЧОснования.Ссылка.ВидЗадолженности,
			|		ТЧОснования.Ссылка.РасчетныйСчет.Договор) КАК ВложенныйЗапрос");
		
		ВидДокумента = ДокументОснование.Метаданные().Имя;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТабличнаяЧасть", 	"Документ." + ВидДокумента + ".Основания");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДоговорКонтрагента", ?(ВидДокумента = "Оплата", "ВЫРАЗИТЬ(ТЧОснования.Ссылка КАК Документ.Оплата).РасчетныйСчетКонтрагента.Договор", "ЗНАЧЕНИЕ(Справочник.Договоры.)"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеСуммы", 			?(ВидДокумента = "Оплата", "ТЧОснования.СуммаОплаты + ТЧОснования.СуммаОплатыКупона", 							"ТЧОснования.Сумма"));
		
		Запрос.УстановитьПараметр("Ссылка",			ДокументОснование);
		Запрос.УстановитьПараметр("СтавкаНДС",		?(СтавкаНДСОснования = Перечисления.СтавкиНДС.ПустаяСсылка(), Перечисления.СтавкиНДС.БезНДС, СтавкаНДСОснования));
		Запрос.УстановитьПараметр("ВалютаУчета",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование.Организация, "ВалютаУчета"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);			
		КонецЕсли;		
	
		// НДФЛ - перечисление в бюджет
		ЭтотОбъект.ПеречислениеВБюджет = Истина;
						
	ИначеЕсли ТипОснования = "ПоручениеНаДвижениеДенежныхСредств" Тогда
		
		ЗаполняемыеРеквизиты = "Организация";	
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПоручениеНаДвижениеДенежныхСредств.Ссылка КАК Ссылка,
			|	ПоручениеНаДвижениеДенежныхСредств.Сумма КАК Сумма,
			|	ПоручениеНаДвижениеДенежныхСредств.Контрагент КАК Контрагент,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
			|	0 КАК СуммаНДС,
			|	ПоручениеНаДвижениеДенежныхСредств.Контрагент = &СФР КАК ПеречислениеВБюджет,
			|	ВЫБОР
			|		КОГДА ПоручениеНаДвижениеДенежныхСредств.Контрагент = &СФР
			|			ТОГДА ВЫБОР
			|					КОГДА ПоручениеНаДвижениеДенежныхСредств.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ВозвратИнвестиционногоДохода)
			|						ТОГДА ЗНАЧЕНИЕ(Справочник.КодыБюджетнойКлассификации.СФР_ВозвратИнвестиционногоДохода)
			|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КодыБюджетнойКлассификации.СФР_ВозвратСредствПенсионныхНакоплений)
			|				КОНЕЦ
			|	КОНЕЦ КАК КодБК,
			|	ВЫБОР
			|		КОГДА ПоручениеНаДвижениеДенежныхСредств.Контрагент = &СФР
			|			ТОГДА ЗначенияДополнительныхСведений.Значение
			|	КОНЕЦ КАК КодОКТМО,
			|	ВЫБОР
			|		КОГДА ПоручениеНаДвижениеДенежныхСредств.Контрагент = &СФР
			|			ТОГДА ""08""
			|	КОНЕЦ КАК СтатусСоставителя
			|ИЗ
			|	Документ.ПоручениеНаДвижениеДенежныхСредств КАК ПоручениеНаДвижениеДенежныхСредств
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
			|		ПО ПоручениеНаДвижениеДенежныхСредств.Контрагент = ЗначенияДополнительныхСведений.Объект
			|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ОКТМОВПлатежномПоручении"")
			|ГДЕ
			|	ПоручениеНаДвижениеДенежныхСредств.Ссылка = &Ссылка");
		
		
		Запрос.УстановитьПараметр("Ссылка", 		ДокументОснование);
		Запрос.УстановитьПараметр("Дата",			ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СФР",			ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ПФР"));
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);			
		КонецЕсли;
				
		// В поручениях на вывод всех активов сумма не заполнена, берем из доп. свойств, если там есть
		Если ЭтотОбъект.Сумма = 0 И ЭтотОбъект.ДополнительныеСвойства.Свойство("Сумма") Тогда
			ЭтотОбъект.Сумма = ЭтотОбъект.ДополнительныеСвойства.Сумма;
		КонецЕсли;
				
	ИначеЕсли ТипОснования = "ПоручениеНаПереводДенежныхСредств" Или ТипОснования = "ПереводДенежныхСредств" Тогда
		
		ЗаполняемыеРеквизиты = "Организация";	
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПоручениеНаПереводДенежныхСредств.Ссылка КАК Ссылка,
			|	ПоручениеНаПереводДенежныхСредств.Сумма КАК Сумма,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
			|	0 КАК СуммаНДС,
			|	ВЫБОР
			|		КОГДА ПоручениеНаПереводДенежныхСредств.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
			|				И ПоручениеНаПереводДенежныхСредств.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|			ТОГДА &НКО_НКЦ
			|		КОГДА ПоручениеНаПереводДенежныхСредств.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
			|			ТОГДА ПоручениеНаПереводДенежныхСредств.Организация.ЮрФизЛицо
			|		КОГДА ПоручениеНаПереводДенежныхСредств.БрокерПолучатель = &БрокерБКРегион
			|				И ПоручениеНаПереводДенежныхСредств.МестоХраненияПолучатель <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
			|			ТОГДА &НКО_НКЦ
			|		ИНАЧЕ ПоручениеНаПереводДенежныхСредств.БрокерПолучатель.ЮрФизЛицо
			|	КОНЕЦ КАК Контрагент
			|ИЗ
			|	&Документ КАК ПоручениеНаПереводДенежныхСредств
			|ГДЕ
			|	ПоручениеНаПереводДенежныхСредств.Ссылка = &Ссылка");		
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ." + ТипОснования);
		
		Запрос.УстановитьПараметр("Ссылка", 		ДокументОснование);
		Запрос.УстановитьПараметр("БрокерБКРегион",	ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион"));
		Запрос.УстановитьПараметр("НКО_НКЦ",		ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);			
		КонецЕсли;					
		
	ИначеЕсли ТипОснования = "Распоряжение" Тогда
		
		ЗаполняемыеРеквизиты = "Организация";	
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Распоряжение.Ссылка КАК Ссылка,
			|	Распоряжение.Сумма КАК Сумма,
			|	Распоряжение.Организация.ЮрФизЛицо КАК Контрагент,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
			|	0 КАК СуммаНДС
			|ИЗ
			|	Документ.Распоряжение КАК Распоряжение
			|ГДЕ
			|	Распоряжение.Ссылка = &Ссылка");
		             	
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);			
		КонецЕсли;
		
	ИначеЕсли ТипОснования = "ПогашениеПаев" Тогда
		
		ЗаполняемыеРеквизиты = "Организация";	
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПогашениеПаев.Ссылка КАК Ссылка,
			|	ПогашениеПаев.Сумма КАК Сумма,
			|	ВЫБОР
			|		КОГДА ПогашениеПаев.Заявка.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
			|			ТОГДА &ЮрФизЛицоОрганизации
			|		ИНАЧЕ ПогашениеПаев.Пайщик
			|	КОНЕЦ КАК Контрагент,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
			|	0 КАК СуммаНДС
			|ИЗ
			|	Документ.ПогашениеПаев КАК ПогашениеПаев
			|ГДЕ
			|	ПогашениеПаев.Ссылка = &Ссылка");
		             	
		Запрос.УстановитьПараметр("Ссылка",					ДокументОснование);
		Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Организация.ЮрФизЛицо"));
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);			
		КонецЕсли;
        	
	ИначеЕсли ТипОснования = "ВводДенежныхСредств" Тогда
		
		ЗаполняемыеРеквизиты = "Организация";
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВводДенежныхСредств.Ссылка КАК Ссылка,
			|	ВводДенежныхСредств.Сумма КАК Сумма,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
			|	0 КАК СуммаНДС,
			|	&ЮрЛицоОрганизации КАК Контрагент
			|ИЗ
			|	Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
			|ГДЕ
			|	ВводДенежныхСредств.Ссылка = &Ссылка");		
		              		
		Запрос.УстановитьПараметр("Ссылка", 			ДокументОснование);
		Запрос.УстановитьПараметр("ЮрЛицоОрганизации",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Организация.ЮрФизЛицо"));
						
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);			
		КонецЕсли;
		
	ИначеЕсли ТипОснования = "Сделка" 
		Или ТипОснования = "СделкаРЕПО"
		Или ТипОснования = "СделкаСНедвижимостью" Тогда
		
		ЗаполняемыеРеквизиты = "Организация";
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сделка.Ссылка КАК Ссылка,
			|	Сделка.Контрагент КАК Контрагент,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
			|	0 КАК СуммаНДС
			|ИЗ
			|	&Документ КАК Сделка
			|ГДЕ
			|	Сделка.Ссылка = &Ссылка");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ." + ТипОснования);
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);			
		КонецЕсли;	
		
		// Добавляем сумму, если нужно
		Если ЭтотОбъект.Сумма = 0 И ЭтотОбъект.ДополнительныеСвойства.Свойство("Сумма") Тогда
			ЭтотОбъект.Сумма = ЭтотОбъект.ДополнительныеСвойства.Сумма;
		КонецЕсли;

	ИначеЕсли ТипОснования = "ОперацияНДС" Тогда
						
		ЗаполняемыеРеквизиты = "Организация";
				
		ЭтотОбъект.СтавкаНДС			= Перечисления.СтавкиНДС.БезНДС;
		ЭтотОбъект.СуммаНДС				= 0;
		ЭтотОбъект.ПеречислениеВБюджет	= Истина;
		
		РеквизитыПеречисленияВБюджет = Документы.ПлатежноеПоручениеИсходящее.РеквизитыПеречисленияВБюджетПоУмолчанию();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыПеречисленияВБюджет); 
		
		// Добавляем сумму
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Сумма") Тогда
			ЭтотОбъект.Сумма = ЭтотОбъект.ДополнительныеСвойства.Сумма;
		КонецЕсли;
				
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование, ЗаполняемыеРеквизиты);	
	
	ЭтотОбъект.ТекстПлательщика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.РасчетныйСчет,				"Договор.НаименованиеВладельцаДляДокументов");
	
	Если ПустаяСтрока(ЭтотОбъект.ТекстПолучателя) Тогда
		ЭтотОбъект.ТекстПолучателя	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.РасчетныйСчетКонтрагента,	"Договор.НаименованиеВладельцаДляДокументов");
	КонецЕсли;
	
	// Для депозитов тексты одинаковые
	Если ТипОснования = "Распоряжение" Тогда
		ЭтотОбъект.ТекстПолучателя = ЭтотОбъект.ТекстПлательщика;	
	КонецЕсли;
	
	//Проверяем и заполняем текст получателя
	Если ПустаяСтрока(ЭтотОбъект.ТекстПолучателя) И ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда		
		ЭтотОбъект.ТекстПолучателя = Документы.ПлатежноеПоручениеИсходящее.ТекстПолучателя(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.Контрагент, ЭтотОбъект.КодБК);
	КонецЕсли;
		
	ЭтотОбъект.НазначениеПлатежа = Документы.ПлатежноеПоручениеИсходящее.ТекстНазначенияПлатежа(ЭтотОбъект);
	
КонецПроцедуры

Функция СтавкаНДСИзОснования(ДокументОснование)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТЧОснования.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	&ТабличнаяЧасть КАК ТЧОснования
		|ГДЕ
		|	ТЧОснования.Ссылка = &Ссылка");
	
	ВидДокумента = ДокументОснование.Метаданные().Имя;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТабличнаяЧасть", "Документ." + ВидДокумента + ".Основания");
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе-основании указаны разные ставки НДС, необходимо проверить назначение платежа");
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтавкаНДС;
	КонецЕсли;
	
	Возврат Перечисления.СтавкиНДС.ПустаяСсылка();
		
КонецФункции

Процедура ПроверитьСогласованиеИРасчетныйСчет(Отказ)
		
	// Если оснований нет, проверять нечего
	Если ЭтотОбъект.Основания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ТипОснования = ЭтотОбъект.Основания[0].Основание.Метаданные().Имя;

	// Согласование и фиксация счетов есть только в отдельных типах документов
	Если Не (ТипОснования = "Распоряжение" Или ТипОснования = "НачислениеЗадолженности" Или СтрНачинаетсяС(ТипОснования, "Поручение")) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипОснования = "Распоряжение" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЛОЖЬ КАК ТребуетсяСогласованиеДокумента,
			|	ДепозитныеВклады.Распоряжение КАК Ссылка,
			|	ДепозитныеВклады.БанковскийСчет КАК РасчетныйСчетПолучатель,
			|	ДепозитныеВклады.Распоряжение.РасчетныйСчет КАК РасчетныйСчет
			|ИЗ
			|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
			|ГДЕ
			|	ДепозитныеВклады.Распоряжение В(&Основания)
			|	И НЕ ДепозитныеВклады.ПометкаУдаления";
		
	ИначеЕсли ТипОснования = "НачислениеЗадолженности" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК ТребуетсяСогласованиеДокумента,
			|	ПоручениеНаДвижениеДенежныхСредств.Ссылка КАК Ссылка,
			|	ПоручениеНаДвижениеДенежныхСредств.РасчетныйСчетПолучатель КАК РасчетныйСчет,
			|	НЕОПРЕДЕЛЕНО КАК РасчетныйСчетПолучатель
			|ИЗ
			|	Документ.ПоручениеНаДвижениеДенежныхСредств КАК ПоручениеНаДвижениеДенежныхСредств
			|ГДЕ
			|	ПоручениеНаДвижениеДенежныхСредств.Основание В(&Основания)
			|	И НЕ ПоручениеНаДвижениеДенежныхСредств.ПометкаУдаления";	
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&ТребуетсяСогласование КАК ТребуетсяСогласованиеДокумента,
			|	ПоручениеНаДвижениеДенежныхСредств.Ссылка КАК Ссылка,
			|	ПоручениеНаДвижениеДенежныхСредств.РасчетныйСчетПолучатель КАК РасчетныйСчетПолучатель,
			|	ПоручениеНаДвижениеДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет
			|ИЗ
			|	&ДокументПоручение КАК ПоручениеНаДвижениеДенежныхСредств
			|ГДЕ
			|	ПоручениеНаДвижениеДенежныхСредств.Ссылка В(&Основания)
			|	И НЕ ПоручениеНаДвижениеДенежныхСредств.ПометкаУдаления В (&Основания)";
				
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДокументПоручение", "Документ." + ТипОснования);	
		
		Запрос.УстановитьПараметр("ТребуетсяСогласование", ТипОснования = "ПоручениеНаДвижениеДенежныхСредств" 
															И РаботаСДокументами.ТребуетсяСогласованиеПорученияНаВыводАктивов(ЭтотОбъект.Основания[0].Основание));
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Основания",						ЭтотОбъект.Основания.ВыгрузитьКолонку("Основание"));
	
	ИспользуетсяСогласование = РаботаСДокументами.ДействуетКонтрольПорученийВнутреннейСистемы(ЭтотОбъект.Дата, ЭтотОбъект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл 	
		
		Если ИспользуетсяСогласование И Выборка.ТребуетсяСогласованиеДокумента
			И Не РаботаСДокументами.ПоручениеНаВыводАктивовСогласовано(Выборка.Ссылка, ТекущаяДатаСеанса()) Тогда	
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено создавать платежное поручение на основании несогласованного поручения [" + Выборка.Ссылка + "]", Выборка.Ссылка,,, Отказ);							
						
		КонецЕсли;
		          					
		Если ЗначениеЗаполнено(Выборка.РасчетныйСчет) И ЭтотОбъект.РасчетныйСчет <> Выборка.РасчетныйСчет Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет списания [" + ЭтотОбъект.РасчетныйСчет + "] не соответствует расчетному счету в документе [" + Выборка.Ссылка + "].", Выборка.Ссылка,,, Отказ);			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.РасчетныйСчетПолучатель) И ЭтотОбъект.РасчетныйСчетКонтрагента <> Выборка.РасчетныйСчетПолучатель Тогда				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет получателя [" + ЭтотОбъект.РасчетныйСчетКонтрагента + "] не соответствует расчетному счету в документе [" + Выборка.Ссылка + "].", Выборка.Ссылка,,, Отказ);			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
